tap "homebrew/bundle"

# Shell foundation.
brew "zsh"
brew "zplug"
brew "fzf"

# Modern CLI experience.
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "jq"
brew "yq"
brew "tree"
brew "duf"
brew "dust"
brew "btop"

# Development workflow.
brew "git"
brew "gh"
brew "pyenv"
brew "nvm"

# Cloud, containers, and Kubernetes.
brew "awscli"
brew "colima"
brew "docker"
brew "docker-compose"
brew "kubectl"
brew "helm"
brew "k9s"

# Terminal and prompt fonts.
cask "iterm2"
cask "font-meslo-lg-nerd-font"
